In [1]:
import pandas as pd

In [18]:
data = [
    ["2차전지(생산)", "SK이노베이션", 10.19, 1.29],
    ["해운", "팬오션", 21.23, 0.95],
    ["시스템반도체", "티엘아이", 35.97, 1.12],
    ["해운", "HMM", 21.52, 3.20],
    ["시스템반도체", "아이에이", 37.32, 3.55],
    ["2차전지(생산)", "LG화학", 83.06, 3.75]
]
columns = ["테마", "종목명", "PER", "PBR"]
df = pd.DataFrame(data=data, columns=columns)
df

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
1        해운      팬오션  21.23  0.95
2    시스템반도체     티엘아이  35.97  1.12
3        해운      HMM  21.52  3.20
4    시스템반도체     아이에이  37.32  3.55
5  2차전지(생산)     LG화학  83.06  3.75

In [22]:
df.rename(columns = {'종목명' : 'number'}, inplace = True)
df = df.set_index('number')
df

               테마    PER   PBR
number
SK이노베이션  2차전지(생산)  10.19  1.29
팬오션            해운  21.23  0.95
티엘아이       시스템반도체  35.97  1.12
HMM            해운  21.52  3.20
아이에이       시스템반도체  37.32  3.55
LG화학     2차전지(생산)  83.06  3.75

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, SK이노베이션 to LG화학
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   테마      6 non-null      object
 1   PER     6 non-null      float64
 2   PBR     6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 192.0+ bytes

In [25]:
df.describe()

             PER       PBR
count   6.000000  6.000000
mean   34.881667  2.310000
std    25.701604  1.319803
min    10.190000  0.950000
25%    21.302500  1.162500
50%    28.745000  2.245000
75%    36.982500  3.462500
max    83.060000  3.750000

NameError: name 'inner' is not defined

In [48]:
df_name = pd.DataFrame({
    '종목코드': [95570, 68400, 27410, 282330, 138930, 1460],
    '회사이름': ['AJ네트웍스', 'SK렌터카', 'AK홀딩스', 'BGF리테일', 'BNK금융지주', 'BYC']
}, columns=['종목코드', '회사이름'])

df_money = pd.DataFrame({
    '회사코드': [95570, 68400, 6840, 27410, 138930, 1460],
    '종가': [20000, 24000, 15000, 5000, 100000, 30000]
}, columns=['회사코드', '종가'])
print('df_name데이터 \n',df_name,'\n')
print('df_money데이터 \n',df_money)

df_name데이터
      종목코드     회사이름
0   95570   AJ네트웍스
1   68400    SK렌터카
2   27410    AK홀딩스
3  282330   BGF리테일
4  138930  BNK금융지주
5    1460      BYC

df_money데이터
      회사코드      종가
0   95570   20000
1   68400   24000
2    6840   15000
3   27410    5000
4  138930  100000
5    1460   30000

In [41]:
df_money.rename(columns = {'회사코드' : '종목코드'}, inplace=True)
df_money

     종목코드      종가
0   95570   20000
1   68400   24000
2    6840   15000
3   27410    5000
4  138930  100000
5    1460   30000

In [43]:
pd.merge(df_name, df_money, how = 'inner', on = '종목코드')

     종목코드     회사이름      종가
0   95570   AJ네트웍스   20000
1   68400    SK렌터카   24000
2   27410    AK홀딩스    5000
3  138930  BNK금융지주  100000
4    1460      BYC   30000

In [51]:
a = pd.merge(df_name, df_money, how = 'outer', left_on = '종목코드', right_on = '회사코드')
# a.drop('회사코드', axis = 1, inplace= True)
a
# print(pd.merge(df_name, df_money, how = 'inner'))
# print(pd.merge(df_name, df_money, how = "outer" ))
# print(pd.merge(df_name, df_money, how = 'left' ))
# print(pd.merge(df_name, df_money, how = 'right' ))

       종목코드     회사이름      회사코드        종가
0   95570.0   AJ네트웍스   95570.0   20000.0
1   68400.0    SK렌터카   68400.0   24000.0
2   27410.0    AK홀딩스   27410.0    5000.0
3  282330.0   BGF리테일       NaN       NaN
4  138930.0  BNK금융지주  138930.0  100000.0
5    1460.0      BYC    1460.0   30000.0
6       NaN      NaN    6840.0   15000.0